using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using Cyriller.Model;

namespace Cyriller
{
    public class CyrPhrase
    {
        protected CyrNounCollection nouCollection;
        protected CyrAdjectiveCollection adjCollection;
        #region Adjective Names

        private readonly string[] _adjectiveNames =
            {
                "Адый",
                "Барый",
                "Батый",
                "Вагый",
                "Мый",
                "Стрый",
                "Абдрефий",
                "Абдулбарий",
                "Абелий",
                "Абилий",
                "Авадий",
                "Авдий",
                "Авелий",
                "Аверий",
                "Авий",
                "Авксентий",
                "Авлерий",
                "Аврамий",
                "Аврелий",
                "Авсентий",
                "Авсий",
                "Австафий",
                "Автандий",
                "Авхадий",
                "Агапий",
                "Агарий",
                "Агасий",
                "Агафий",
                "Агений",
                "Агий",
                "Агурий",
                "Адалий",
                "Аделий",
                "Адий",
                "Адолий",
                "Аеатолий",
                "Азалий",
                "Азарий",
                "Аий",
                "Акадий",
                "Акинфий",
                "Аксений",
                "Аксентий",
                "Актавий",
                "Акший",
                "Алезий",
                "Алексий",
                "Алемпий",
                "Алентий",
                "Алерий",
                "Алий",
                "Алимпий",
                "Алипий",
                "Алисий",
                "Алиферий",
                "Аллий",
                "Алоизий",
                "Алфий",
                "Альбий",
                "Альфий",
                "Амандий",
                "Амарбий",
                "Амасий",
                "Амбросий",
                "Амвросий",
                "Амний",
                "Амплий",
                "Амросий",
                "Амурбий",
                "Аналий",
                "Аналолий",
                "Ананий",
                "Анаотлий",
                "Анарий",
                "Анастазий",
                "Анастасий",
                "Анаталий",
                "Анатилий",
                "Анатлий",
                "Анатодий",
                "Анатодлий",
                "Анатолий",
                "Анатоний",
                "Анатрлий",
                "Анафий",
                "Анвтолий",
                "Ангелий",
                "Анджий",
                "Андий",
                "Андрий",
                "Андрий",
                "Андрий",
                "Андроний",
                "Анзорий",
                "Аний",
                "Анисий",
                "Аннаний",
                "Аннарий",
                "Анолий",
                "Анотолий",
                "Антий",
                "Антипий",
                "Антолий",
                "Антоний",
                "Ануфрий",
                "Анфилофий",
                "Аполинарий",
                "Аполлинарий",
                "Аполлоний",
                "Аполоний",
                "Апполинарий",
                "Апполоний",
                "Апсилий",
                "Арадий",
                "Арамбий",
                "Аратолий",
                "Арефий",
                "Ариадий",
                "Арий",
                "Аркадий",
                "Аркалий",
                "Арнадий",
                "Арнолий",
                "Арсанофий",
                "Арсений",
                "Арсентий",
                "Артемий",
                "Артурий",
                "Асафий",
                "Асий",
                "Асилий",
                "Аскарбий",
                "Аскербий",
                "Аспазий",
                "Астафий",
                "Астерий",
                "Атолий",
                "Аурелий",
                "Афанасий",
                "Афанисий",
                "Афаносий",
                "Афонасий",
                "Афоний",
                "Афраний",
                "Афтений",
                "Ахий",
                "Бабий",
                "Бабий",
                "Бадрий",
                "Базий",
                "Балтий",
                "Бедрий",
                "Бедрий",
                "Бий",
                "Бий",
                "Бий",
                "Бий",
                "Бий",
                "Бий",
                "Бий",
                "Бий",
                "Бонифаций",
                "Брий",
                "Вавилий",
                "Вадерий",
                "Вадий",
                "Ваилий",
                "Валарий",
                "Валдерий",
                "Валевий",
                "Валегий",
                "Валений",
                "Валентий",
                "Валерий",
                "Валетий",
                "Валий",
                "Валилий",
                "Валоерий",
                "Ванатолий",
                "Ванифантий",
                "Ванифатий",
                "Ванцетий",
                "Вареанофий",
                "Варий",
                "Варламий",
                "Варсанофий",
                "Варсонофий",
                "Васидий",
                "Васий",
                "Василдий",
                "Василий",
                "Василтий",
                "Вастилий",
                "Ваталий",
                "Вгений",
                "Везувий",
                "Велерий",
                "Велорий",
                "Венадий",
                "Веналий",
                "Венарий",
                "Венедий",
                "Веннадий",
                "Вергилий",
                "Вержилий",
                "Веталий",
                "Виалий",
                "Виаталий",
                "Виатлий",
                "Видадий",
                "Видалий",
                "Вииалий",
                "Викентий",
                "Виккентий",
                "Викситий",
                "Викталий",
                "Викторий",
                "Вилалий",
                "Виларий",
                "Вилатий",
                "Вилений",
                "Вилий",
                "Виллий",
                "Виллорий",
                "Вилорий",
                "Вильгений",
                "Винарий",
                "Виралий",
                "Виссарий",
                "Витадий",
                "Виталий",
                "Вителий",
                "Витиалий",
                "Владий",
                "Вларий",
                "Власий",
                "Волий",
                "Володарий",
                "Володий",
                "Вонифатий",
                "Вялий",
                "Гадий",
                "Газий",
                "Галерий",
                "Ганий",
                "Гарафий",
                "Гарегий",
                "Гарий",
                "Гаррий",
                "Гдалий",
                "Гедалий",
                "Геларий",
                "Гелларий",
                "Генадий",
                "Генанадий",
                "Генандий",
                "Геннадий",
                "Генналий",
                "Геннедий",
                "Генний",
                "Геогий",
                "Георгий",
                "Георий",
                "Герадий",
                "Герантий",
                "Герасий",
                "Гервасий",
                "Гергий",
                "Герий",
                "Герогий",
                "Героний",
                "Геронтий",
                "Геррадий",
                "Герргий",
                "Гигорий",
                "Гидалий",
                "Гиланий",
                "Гиларий",
                "Гилярий",
                "Гинадий",
                "Глорий",
                "Гонорий",
                "Гораций",
                "Горгий",
                "Гордий",
                "Горий",
                "Грегорий",
                "Григоорий",
                "Григорий",
                "Григортий",
                "Григрий",
                "Григшорий",
                "Гудзий",
                "Гурий",
                "Далий",
                "Даний",
                "Дарий",
                "Дасий",
                "Даулеткалий",
                "Дезидерий",
                "Делий",
                "Дементий",
                "Демитрий",
                "Денисий",
                "Деонизий",
                "Деонисий",
                "Джорий",
                "Диментий",
                "Димитрий",
                "Динадий",
                "Дионизий",
                "Дионисий",
                "Дмитирий",
                "Дмитрий",
                "Довлетбий",
                "Долий",
                "Дорий",
                "Евганий",
                "Евгений",
                "Евграфий",
                "Евений",
                "Евладий",
                "Евлампий",
                "Евлантий",
                "Евлогий",
                "Евмений",
                "Евментий",
                "Евнений",
                "Евпатий",
                "Еврений",
                "Евсафий",
                "Евсений",
                "Евстафий",
                "Евстахий",
                "Евстихий",
                "Евстратий",
                "Евстрафий",
                "Евтафий",
                "Евтифий",
                "Евтихий",
                "Евтропий",
                "Евфимий",
                "Егорий",
                "Еграфий",
                "Елефтерий",
                "Елизарий",
                "Елиферий",
                "Елладий",
                "Емилий",
                "Епифаний",
                "Ергений",
                "Еремий",
                "Ефимий",
                "Ефремий",
                "Ефросиний",
                "Ефстафий",
                "Ефтемий",
                "Ефтений",
                "Жорий",
                "Заруий",
                "Застрожний",
                "Заурий",
                "Захарий",
                "Зеновий",
                "Зиновий",
                "Иануарий",
                "Ивлий",
                "Ивсталий",
                "Игнатий",
                "Изий",
                "Икарий",
                "Иларий",
                "Илларий",
                "Илярий",
                "Иннокентий",
                "Инокентий",
                "Ипатий",
                "Ираклий",
                "Иргалий",
                "Ириний",
                "Иувиналий",
                "Иювиналий",
                "Июлий",
                "Калентий",
                "Канафий",
                "Карпий",
                "Каспий",
                "Каспий",
                "Кирий",
                "Клавдий",
                "Клавий",
                "Кларий",
                "Клементий",
                "Клий",
                "Клий",
                "Климентий",
                "Кондратий",
                "Конкордий",
                "Конфуций",
                "Корнелий",
                "Корнилий",
                "Ксаверий",
                "Курбангалий",
                "Лаврентий",
                "Ладий",
                "Лазарий",
                "Ларгий",
                "Леверий",
                "Левий",
                "Левонтий",
                "Ленарий",
                "Леонардий",
                "Леонитий",
                "Леонтий",
                "Ливерий",
                "Лидий",
                "Линарий",
                "Лионтий",
                "Лолий",
                "Лутфий",
                "Люрий",
                "Мавий",
                "Мавлявий",
                "Магановий",
                "Макарий",
                "Мардарий",
                "Марий",
                "Марий",
                "Мартерий",
                "Мартирий",
                "Мелентий",
                "Мелетий",
                "Меркурий",
                "Методий",
                "Мефодий",
                "Милантий",
                "Милий",
                "Мингалий",
                "Назарий",
                "Нарий",
                "Нефодий",
                "Никитий",
                "Новороссий",
                "Овидий",
                "Озарий",
                "Оксений",
                "Оксентий",
                "Оксий",
                "Октавий",
                "Олексий",
                "Олимпий",
                "Онофрий",
                "Онуфрий",
                "Остафий",
                "Отарий",
                "Паисий",
                "Панкратий",
                "Панфилий",
                "Парфений",
                "Парфентий",
                "Парферий",
                "Парфирий",
                "Пафнутий",
                "Перфилий",
                "Пий",
                "Полинарий",
                "Порфилий",
                "Порфирий",
                "Прокопий",
                "Прокофий",
                "Протасий",
                "Радий",
                "Ревилий",
                "Ренадий",
                "Реннадий",
                "Роландий",
                "Савватий",
                "Савелий",
                "Салий",
                "Сальбий",
                "Самотечний",
                "Сафроний",
                "Сергий",
                "Сий",
                "Силантий",
                "Сильвий",
                "Синарий",
                "Славентий",
                "Славий",
                "Созонтий",
                "Софроний",
                "Ставрий",
                "Стефаний",
                "Стратий",
                "Стратий",
                "Таврий",
                "Тарий",
                "Теодозий",
                "Теодорий",
                "Теодосий",
                "Терентий",
                "Тиберий",
                "Товий",
                "Трифилий",
                "Троадий",
                "Увгений",
                "Увеналий",
                "Уллубий",
                "Уссурий",
                "Фавий",
                "Фаддий",
                "Фадий",
                "Фаний",
                "Февзий",
                "Федорий",
                "Федосий",
                "Феодосий",
                "Феофаний",
                "Феохарий",
                "Филий",
                "Флавий",
                "Флорий",
                "Фотий",
                "Харламий",
                "Харлампий",
                "Хий",
                "Цезарий",
                "Эвгений",
                "Эгедий",
                "Элиферий",
                "Эллий",
                "Эмилий",
                "Эрий",
                "Ювеналий",
                "Ювиналий",
                "Юзефий",
                "Юлий",
                "Юрий",
                "Юрий",
                "Юрний",
                "Януарий",
                "Деметрий",
                "Анатой",
                "Асанбой",
                "Кадамбой",
                "Ражаббой",
                "Ражабой",
                "Султанбой"
            };
        #endregion

        public CyrPhrase(CyrNounCollection NouCollection, CyrAdjectiveCollection AdjCollection)
        {
            this.nouCollection = NouCollection;
            this.adjCollection = AdjCollection;
        }

        public SpeechPartsEnum DetermineSpeechPart(string Word)
        {
            string[] ends = new string[] { "ый", "ий", "ой", "ся", "ая", "яя", "ое", "ее" };
            if (ends.Any(val => Word.EndsWith(val)) && !_adjectiveNames.Contains(Word))
            {
                return SpeechPartsEnum.Adjective;
            }

            return SpeechPartsEnum.Noun;
        }

        public CyrResult Decline(string Phrase, GetConditionsEnum Condition)
        {
            return this.Decline(Phrase, Condition, NumbersEnum.Singular);
        }

        public CyrResult DeclinePlural(string Phrase, GetConditionsEnum Condition)
        {
            return this.Decline(Phrase, Condition, NumbersEnum.Plural);
        }

        protected CyrResult Decline(string Phrase, GetConditionsEnum Condition, NumbersEnum Number)
        {
            if (Phrase.IsNullOrEmpty())
            {
                return new CyrResult();
            }

            List<object> words = new List<object>();
            string[] parts = Phrase.Split(' ').Select(val => val.Trim()).Where(val => val.IsNotNullOrEmpty()).ToArray();
            List<CyrResult> results = new List<CyrResult>();
            
            foreach (string w in parts)
            {
                SpeechPartsEnum speech = this.DetermineSpeechPart(w);

                switch (speech)
                {
                    case SpeechPartsEnum.Adjective:
                        CyrAdjective adj = this.adjCollection.Get(w, Condition);
                        words.Add(adj);
                        break;
                    case SpeechPartsEnum.Noun:
                        CyrNoun noun = this.nouCollection.Get(w, Condition);
                        words.Add(noun);
                        break;
                    default:
                        throw new ArgumentException("This speech part is not supported yet. Speech part: " + speech.ToString());
                }
            }

            for (int i = 0; i < words.Count; i++)
            {
                CyrNoun noun = words[i] as CyrNoun;

                if (noun != null)
                {
                    if (Number == NumbersEnum.Plural)
                    {
                        results.Add(noun.DeclinePlural());
                    }
                    else
                    {
                        results.Add(noun.Decline());
                    }
                    
                    continue;
                }

                CyrAdjective adj = words[i] as CyrAdjective;
                
                noun = this.GetNextPreviousNoun(words, i);

                if (Number == NumbersEnum.Plural)
                {
                    if (noun != null)
                    {
                        results.Add(adj.DeclinePlural(noun.Animate));
                    }
                    else
                    {
                        results.Add(adj.DeclinePlural(AnimatesEnum.Animated));
                    }
                }
                else
                {
                    if (noun != null)
                    {
                        results.Add(adj.Decline(noun.Animate));
                    }
                    else
                    {
                        results.Add(adj.Decline(AnimatesEnum.Animated));
                    }
                }
            }

            CyrResult result = results.First();

            for (int i = 1; i < results.Count; i++)
            {
                result = result + results[i];
            }

            return result;
        }

        protected CyrNoun GetNextPreviousNoun(List<object> Words, int Index)
        {
            CyrNoun noun = this.GetNextNoun(Words, Index);

            if (noun == null)
            {
                noun = this.GetPreviousNoun(Words, Index);
            }

            return noun;
        }

        protected CyrNoun GetNextNoun(List<object> Words, int Index)
        {
            for (int i = Index + 1; i < Words.Count; i++)
            {
                if (Words[i] is CyrNoun)
                {
                    return Words[i] as CyrNoun;
                }
            }

            return null;
        }

        protected CyrNoun GetPreviousNoun(List<object> Words, int Index)
        {
            for (int i = Index - 1; i >= 0; i--)
            {
                if (Words[i] is CyrNoun)
                {
                    return Words[i] as CyrNoun;
                }
            }

            return null;
        }
    }
}
